Revit 2015 API
BuiltInFailures.GlobalParameterFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.GlobalParameterFailures type exposes the following members.
Properties
Name | Description
ElementPropLinkCircularChain
 Linked properties in highlighted elements cause a circular chain of references.
ElementPropLinkCircularChainError
 Linked properties in highlighted elements cause a circular chain of references.
GlobalParamFormulaCircularChain
 A formula in a global parameter causes a circular chain of references between highlighted elements.
GlobalParamFormulaCircularChainError
 A formula in a global parameter causes a circular chain of references between highlighted elements.
InvalidElementPropToGlobalParamLink
 The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!.
See Also
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace